cf_billing/Catalogs/энргТипыУзловУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргТипыУзловУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКанальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыКанальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставУзла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИзмерителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеИзмерителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрируетОбъем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВспомогательноеОборудование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фаза</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргФазыТрансформатора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыТипаИзмерителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргТипыУзловУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСоставУзлаИШкалы(ТипУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТипыУзловУчета.Ссылка КАК ТипУзла,
		|	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	энргТипыУзловУчетаСоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
		|	энргТипыУзловУчетаСоставУзла.IDСтроки КАК IDСтроки,
		|	энргТипыУзловУчетаСоставУзла.Фаза КАК Фаза
		|ПОМЕСТИТЬ ВТ_СоставУзла
		|ИЗ
		|	Справочник.энргТипыУзловУчета КАК энргТипыУзловУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
		|		ПО энргТипыУзловУчета.Ссылка = энргТипыУзловУчетаСоставУзла.Ссылка
		|			И (энргТипыУзловУчета.Ссылка = &ТипУзла)
		|			И (энргТипыУзловУчетаСоставУзла.Ссылка = &ТипУзла)
		|			И (НЕ энргТипыУзловУчета.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставУзла.ТипУзла КАК ТипУзла,
		|	ВТ_СоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	ВТ_СоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ВТ_СоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВТ_СоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
		|	ЕСТЬNULL(энргТипыУзловУчетаШкалыТипаИзмерителя.Шкала, """") КАК Шкала,
		|	ЕСТЬNULL(энргТипыУзловУчетаШкалыТипаИзмерителя.IDСтроки, """") КАК IDСтрокиШкалыИзмерителя,
		|	ВТ_СоставУзла.IDСтроки КАК IDСтрокиСостава,
		|	ВТ_СоставУзла.Фаза КАК Фаза
		|ИЗ
		|	ВТ_СоставУзла КАК ВТ_СоставУзла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.ШкалыТипаИзмерителя КАК энргТипыУзловУчетаШкалыТипаИзмерителя
		|		ПО ВТ_СоставУзла.IDСтроки = энргТипыУзловУчетаШкалыТипаИзмерителя.IDСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	IDСтрокиСостава";
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСоставУзла(ТипУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТипыУзловУчета.Ссылка КАК ТипУзла,
		|	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	энргТипыУзловУчетаСоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование
		|ИЗ
		|	Справочник.энргТипыУзловУчета КАК энргТипыУзловУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
		|		ПО энргТипыУзловУчета.Ссылка = энргТипыУзловУчетаСоставУзла.Ссылка
		|			И (энргТипыУзловУчета.Ссылка = &ТипУзла)
		|			И (энргТипыУзловУчетаСоставУзла.Ссылка = &ТипУзла)
		|			И (НЕ энргТипыУзловУчета.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
